Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFF144.atdf
      <value-group caption="ADC Global Interrupt Enable bits for analog input 22" name="ADCGIRQEN1__AGIEN22">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 23" name="ADCGIRQEN1__AGIEN23">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 24" name="ADCGIRQEN1__AGIEN24">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 25" name="ADCGIRQEN1__AGIEN25">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 26" name="ADCGIRQEN1__AGIEN26">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 27" name="ADCGIRQEN1__AGIEN27">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 28" name="ADCGIRQEN1__AGIEN28">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 29" name="ADCGIRQEN1__AGIEN29">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 30" name="ADCGIRQEN1__AGIEN30">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 31" name="ADCGIRQEN1__AGIEN31">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 32" name="ADCGIRQEN2__AGIEN32">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 33" name="ADCGIRQEN2__AGIEN33">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 34" name="ADCGIRQEN2__AGIEN34">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 35" name="ADCGIRQEN2__AGIEN35">
         <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
         <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
