Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFF144.atdf
         <register caption="CAN Acceptance Filter " name="C1RXF2" offset="0x160" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF2__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF2__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF2__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF2" offset="0x1160" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF2__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF2__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF2__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF3" offset="0x170" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF3__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF3__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF3__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF3" offset="0x1170" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF3__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF3__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF3__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF4" offset="0x180" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF4__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF4__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF4__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF4" offset="0x1180" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF4__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF4__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF4__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF5" offset="0x190" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF5__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF5__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF5__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF5" offset="0x1190" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF5__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF5__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF5__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF6" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF6__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF6__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF6__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF6" offset="0x11a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF6__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF6__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF6__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF7" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF7__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF7__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF7__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF7" offset="0x11b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF7__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF7__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF7__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF8" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF8__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF8__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF8__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF8" offset="0x11c0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF8__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF8__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF8__SID"/>
         </register>
