Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFF144.atdf
      <value-group caption="Group2 Read Permissions bits" name="SBT5RD0__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT5RD0__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT5RD1__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT5RD1__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT5RD1__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT5RD1__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT5RD2__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT5RD2__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT5RD2__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT5RD2__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT6RD0__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT6RD0__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT6RD0__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT6RD0__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT6RD1__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT6RD1__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT6RD1__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT6RD1__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT7RD0__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT7RD0__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT7RD0__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT7RD0__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT7RD1__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
